/*******************************************************************************
 *  @file      task3.h
 *  @brief     Очень сильно W.I.P...
 *  @author    Young Sideways
 *  @date      14.02.2024
 *  @copyright © Young Sideways, 2024. All right reserved.
 ******************************************************************************/
#pragma once

/*

    Тема 3. Сортировка данных

    Задание 1. Реализовать программу, реализующую простейший метод сортировки массивов:
        сортировку выбором
        сортировку вставками
    Каждый метод реализуется своей подпрограммой, добавляемой в основную программу по мере разработки.
    Кроме того, необходима вспомогательная подпрограмма генерации исходного массива случайных целых чисел с заданным числом элементов (не более 10 000) и выводом этого массива на экран
    Каждый исходный массив должен обрабатываться всеми подпрограммами сортировки с подсчетом и выводом фактического числа выполненных сравнений и пересылок.
    Поскольку каждый из универсальных методов выполняет сортировку “на месте”, т.е. изменяет исходный массив, то для наглядности работы
    можно передавать в подпрограмму сортировки копию исходного массива, объявив его как параметр-значение.
    После завершения разработки программы необходимо выполнить всеми методами сортировку нескольких массивов с разным числом элементов (10, 100, 1000, 10000)
    и провести сравнительный анализ эффективности рассматриваемых методов.
    Главная программа должна реализовать диалог с пользователем для выбора метода сортировки.

    Задание 2. Оформить программу, реализующую метод быстрой сортировки массивов.
    Метод реализуется в виде подпрограммы. Исходный массив должен обрабатываться подпрограммой сортировки с подсчетом и выводом фактического числа выполненных сравнений и пересылок.
    Выполнить сортировку нескольких массивов с разным числом элементов (10, 100, 1000, 10000).

*/

int task3();
